{
    "sadness": [{
        "ayah": "93:5",
        "ayahNumber": 6127,
        "topic": "A promise of ease and the afterlife.",
        "arabic": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰٓ ٥",
        "translation": "And [surely] your Lord will give so much to you that you will be pleased.",
        "commentarySource": "Sourced from Tafsir al-Jalalayn and scholarly discussions on the context of Surah Ad-Duha.",
        "noteToUser": "This verse was revealed to the Prophet Muhammad (PBUH) to comfort him during a period of despair. It is a powerful reminder that Allah will surely provide for you, not just in this life, but also in the next, and He will grant you a sense of inner satisfaction that no worldly thing can give."
    }, {
        "ayah": "2:286",
        "ayahNumber": 293,
        "topic": "Trust in Allah's plan and capacity.",
        "arabic": "لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًۭا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ ٥",
        "translation": "Allah does not require of any soul more than what it can afford. All good will be for its own benefit, and all evil will be to its own loss. [The believers pray,] 'Our Lord! Do not punish us if we forget or make a mistake. Our Lord! Do not place a burden on us like the one you placed on those before us. Our Lord! Do not burden us with what we cannot bear. Pardon us, forgive us, and have mercy on us. You are our [only] Guardian. So grant us victory over the disbelieving people.",
        "commentarySource": "Cited across most major Tafsir (e.g., Tafsir Ibn Kathir).",
        "noteToUser": "When life feels too heavy to carry, this verse serves as a direct, compassionate message from Allah. It is a promise that every challenge you face is within your capacity to endure and that Allah has already equipped you with the strength to overcome it."
    }, {
        "ayah": "2:153",
        "ayahNumber": 160,
        "topic": "Seeking help through patience and prayer.",
        "arabic": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ ٥",
        "translation": "O believers! Seek comfort in patience and prayer. Allah is truly with those who are patient.",
        "commentarySource": "A foundational verse discussed in all major Tafsir and in the works of scholars like Nouman Ali Khan.",
        "noteToUser": "This verse provides a practical and spiritual prescription for overcoming sadness. It reminds you to turn to two of your most powerful tools: unwavering patience in the face of adversity and the direct connection of prayer. When you are patient, you are promised the immense blessing of Allah's companionship."
    }, {
        "ayah": "9:51",
        "ayahNumber": 1288,
        "topic": "Reliance on Allah (Tawakkul).",
        "arabic": "قُل لَّن يُصِيبَنَآ إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوْلَىٰنَا ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ ٥",
        "translation": "Say, 'Nothing will ever befall us except what Allah has destined for us. He is our Protector.' So in Allah let the believers put their trust.",
        "commentarySource": "A cornerstone of the concept of Tawakkul, found in the teachings of the Yaqeen Institute.",
        "noteToUser": "This verse empowers you by reminding you that while we may feel powerless in the face of life's struggles, Allah's decree is final and He is the ultimate protector. By entrusting your affairs to Him, you can release the heavy burden of worry and find peace in knowing that He is in control."
    }, {
        "ayah": "94:5-6",
        "ayahNumber": 6138,
        "topic": "Ease after hardship.",
        "arabic": "فَإِنَّ مَعَ ٱلْعُسْرِ يُسْرًا ٥ إِنَّ مَعَ ٱلْعُسْرِ يُسْرًۭا ٥",
        "translation": "So, surely with hardship comes ease. Surely with [that] hardship comes [more] ease.",
        "commentarySource": "The repetition of this verse is a key point of emphasis in Tafsir and sermons.",
        "noteToUser": "This is one of the most comforting verses in the Quran. The divine promise is repeated for emphasis, assuring you that your current hardship is not a dead end. Relief and ease are not simply waiting 'after' your struggle; they are inseparably 'with' it."
    }],
    "joy": [{
        "ayah": "10:58",
        "ayahNumber": 1459,
        "topic": "Rejoicing in Allah's mercy.",
        "arabic": "قُلْ بِفَضْلِ ٱللَّهِ وَبِرَحْمَتِهِۦ فَبِذَٰلِكَ فَلْيَفْرَحُوا۟ هُوَ خَيْرٌۭ مِّمَّا يَجْمَعُونَ ٥",
        "translation": "Say, [O Prophet,] 'In Allah's grace and mercy let them rejoice. That is far better than whatever [wealth] they amass.'",
        "commentarySource": "Cited by scholars when distinguishing true joy from temporary happiness (Tafsir Ibn Kathir).",
        "noteToUser": "When you feel joy, this verse guides you on what to truly rejoice in. It teaches that the greatest source of happiness is not in what you have gathered from this world, but in the boundless mercy and blessings that Allah has bestowed upon you. This is the only joy that is permanent and meaningful."
    }, {
        "ayah": "14:7",
        "ayahNumber": 1797,
        "topic": "Gratitude for blessings.",
        "arabic": "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِن شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِن كَفَرْتُمْ إِنَّ عَذَابِى لَشَدِيدٌۭ ٥",
        "translation": "And [remember] when your Lord proclaimed, 'If you are grateful, I will certainly give you more. But if you are ungrateful, surely My punishment is severe.'",
        "commentarySource": "A core principle of gratitude in Islam, emphasized in countless books and lectures.",
        "noteToUser": "This verse outlines the beautiful and simple formula for an increase in blessings. When you are feeling happy, this is the perfect time to show gratitude, because Allah has promised to respond to your gratefulness by giving you even more."
    }, {
        "ayah": "2:152",
        "ayahNumber": 159,
        "topic": "Remembrance of Allah.",
        "arabic": "فَٱذْكُرُونِىٓ أَذْكُرْكُمْ وَٱشْكُرُوا۟ لِى وَلَا تَكْفُرُونِ ٥",
        "translation": "So remember Me; I will remember you. And thank Me, and never be ungrateful.",
        "commentarySource": "A constant reminder in Islamic practice and Tafsir to maintain gratitude.",
        "noteToUser": "This verse links two powerful concepts: remembrance and gratitude. When you are joyful, remember the One who gave you that joy. By remembering Allah, you strengthen your bond with Him, and you are promised that He will remember you in return."
    }, {
        "ayah": "2:195",
        "ayahNumber": 202,
        "topic": "Doing good as an expression of gratitude.",
        "arabic": "وَأَنفِقُوا۟ فِى سَبِيلِ ٱللَّهِ وَلَا تُلْقُوا۟ بِأَيْدِيكُمْ إِلَى ٱلتَّهْلُكَةِ ۛ وَأَحْسِنُوٓا۟ ۛ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُحْسِنِينَ ٥",
        "translation": "And spend in the way of Allah and do not throw [yourselves] with your [own] hands into destruction [by refraining]. And do good; indeed, Allah loves the doers of good.",
        "commentarySource": "Used to describe how believers express gratitude for their blessings (Tafsir Al-Mizan).",
        "noteToUser": "Your joy is a blessing, and this verse teaches you how to give that joy a powerful expression: by doing good and helping others. The greatest form of gratitude is to use the blessings Allah has given you to benefit His creation."
    }, {
        "ayah": "13:28",
        "ayahNumber": 1782,
        "topic": "Inner peace and hearts finding rest.",
        "arabic": "ٱلَّذِينَ ءَامَنُوا۟ وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ ٱللَّهِ ۗ أَلَا بِذِكْرِ ٱللَّهِ تَطْمَئِنُّ ٱلْقُلُوبُ ٥",
        "translation": "Those who believe and whose hearts find comfort in the remembrance of Allah. Surely in the remembrance of Allah do hearts find comfort.",
        "commentarySource": "A famous verse for seeking peace and contentment in Islam.",
        "noteToUser": "Even when you are happy, true and lasting peace comes from a connection with Allah. This verse reminds you that the source of all peace is the remembrance of your Creator. It is a powerful reminder to turn your joy into an act of worship by remembering Him, which in turn will give you an even deeper sense of tranquility."
    }],
    "love": [{
        "ayah": "3:31",
        "ayahNumber": 349,
        "topic": "Loving Allah by following the Prophet (PBUH).",
        "arabic": "قُلْ إِن كُنتُمْ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِى يُحْبِبْكُمُ ٱللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَٱللَّهُ غَفُورٌۭ رَّحِيمٌۭ ٥",
        "translation": "Say, [O Prophet,] 'If you [sincerely] love Allah, then follow me; Allah will love you and forgive your sins. For Allah is All-Forgiving, Most Merciful.'",
        "commentarySource": "A pivotal verse for understanding the true meaning of loving Allah (Tafsir Al-Jalalayn).",
        "noteToUser": "This verse provides the ultimate roadmap for anyone who says they love Allah. It teaches that love is not just a feeling, but an act of obedience. By following the example of Prophet Muhammad (PBUH), you are promised that Allah will reciprocate your love and grant you forgiveness."
    }, {
        "ayah": "2:165",
        "ayahNumber": 172,
        "topic": "The love of believers for Allah.",
        "arabic": "وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادًۭا يُحِبُّونَهُمْ كَحُبِّ ٱللَّهِ ۖ وَٱلَّذِينَ ءَامَنُوٓا۟ أَشَدُّ حُبًّۭا لِّلَّهِ ۗ وَلَوْ يَرَى ٱلَّذِينَ ظَلَمُوٓا۟ إِذْ يَرَوْنَ ٱلْعَذَابَ أَنَّ ٱلْقُوَّةَ لِلَّهِ جَمِيعًۭا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلْعَذَابِ ٥",
        "translation": "Still there are some who take others as Allah's equal — they love them as they should love Allah — but the [true] believers love Allah even more. If only the wrongdoers could see the [horrible] punishment [awaiting them], they would certainly realize that all power belongs to Allah and that Allah is indeed severe in punishment.",
        "commentarySource": "Highlights the unmatched and supreme love a believer has for Allah in all major Tafsir.",
        "noteToUser": "This verse distinguishes the love of a believer from misplaced love. It reminds you that while we may love people and things in this world, the love of a true believer for Allah is stronger than any other love. This love is the most pure and profound of all feelings."
    }, {
        "ayah": "5:54",
        "ayahNumber": 732,
        "topic": "Mutual love between Allah and believers.",
        "arabic": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ مَن يَرْتَدَّ مِنكُمْ عَن دِينِهِۦ فَسَوْفَ يَأْتِى ٱللَّهُ بِقَوْمٍۢ يُحِبُّهُمْ وَيُحِبُّونَهُۥٓ أَذِلَّةٍ عَلَى ٱلْمُؤْمِنِينَ أَعِزَّةٍ عَلَى ٱلْكَـٰفِرِينَ يُجَـٰهِدُونَ فِى سَبِيلِ ٱللَّهِ وَلَا يَخَافُونَ لَوْمَةَ لَآئِمٍۢ ۚ ذَٰلِكَ فَضْلُ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ ٥",
        "translation": "O believers! Whoever among you abandons their faith, Allah will replace them with others who love Him and are loved by Him. They will be humble with the believers but firm towards the disbelievers, struggling in the Way of Allah; fearing no blame from anyone. This is the favour of Allah. He grants it to whoever He wills. And Allah is All-Bountiful, All-Knowing.",
        "commentarySource": "Cited in discussions of the mutual love between the Creator and His creation.",
        "noteToUser": "It is a humbling and beautiful thought that Allah loves us. This verse confirms that there is a mutual love between Allah and His servants. It is an immense blessing to be among those whom He loves, and a motivation to strive to be a person He loves by being humble and showing mercy to others."
    }, {
        "ayah": "2:216",
        "ayahNumber": 223,
        "topic": "Love and hate in Allah's knowledge.",
        "arabic": "كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ وَهُوَ كُرْهٌۭ لَّكُمْ ۖ وَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًۭٔا وَهُوَ خَيْرٌۭ لَّكُمْ ۖ وَعَسَىٰٓ أَن تُحِبُّوا۟ شَيْـًۭٔا وَهُوَ شَرٌّۭ لَّكُمْ ۗ وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ ٥",
        "translation": "Fighting has been made obligatory upon you [believers], though you dislike it. Perhaps you dislike something which is good for you and like something which is bad for you. Allah knows and you do not know.",
        "commentarySource": "Used to temper our feelings with the wisdom of Allah's plan (Tafsir Al-Mizan).",
        "noteToUser": "While you feel love, this verse provides a crucial perspective. It reminds us that our love for something or someone in this world may not always be what is best for us. The greatest act of love and trust is to submit our desires to Allah's will, for only He knows what is truly beneficial for us."
    }, {
        "ayah": "3:159",
        "ayahNumber": 466,
        "topic": "Allah's love for those who rely on Him.",
        "arabic": "فَبِمَا رَحْمَةٍۢ مِّنَ ٱللَّهِ لِنتَ لَهُمْ ۖ وَلَوْ كُنتَ فَظًّا غَلِيظَ ٱلْقَلْبِ لَٱنفَضُّوا۟ مِنْ حَوْلِكَ ۖ فَٱعْفُ عَنْهُمْ وَٱسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِى ٱلْأَمْرِ ۖ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى ٱللَّهِ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُتَوَكِّلِينَ ٥",
        "translation": "It is out of Allah's mercy that you [O Prophet] have been lenient with them. Had you been cruel or hard-hearted, they would have certainly abandoned you. So pardon them, ask Allah's forgiveness for them, and consult with them in [conducting] matters. Once you make a decision, put your trust in Allah. Surely Allah loves those who trust in Him.",
        "commentarySource": "Emphasizes Tawakkul as an act of love for Allah.",
        "noteToUser": "This verse tells you that when you have made a sincere effort, your ultimate love for Allah is shown by relying on Him. He loves those who put their trust in Him, as it is a sign of complete faith and recognition of His power and wisdom."
    }],
    "anger": [{
        "ayah": "3:134",
        "ayahNumber": 441,
        "topic": "Restraining anger and forgiving people.",
        "arabic": "ٱلَّذِينَ يُنفِقُونَ فِى ٱلسَّرَّآءِ وَٱلضَّرَّآءِ وَٱلْكَـٰظِمِينَ ٱلْغَيْظَ وَٱلْعَافِينَ عَنِ ٱلنَّاسِ ۗ وَٱللَّهُ يُحِبُّ ٱلْمُحْسِنِينَ ٥",
        "translation": "[They are] those who donate in prosperity and adversity, control their anger, and pardon others. And Allah loves the good-doers.",
        "commentarySource": "Considered the most direct command to manage anger in the Quran.",
        "noteToUser": "Anger is a natural human emotion, but this verse sets a high standard for a believer. It elevates the act of suppressing your rage and forgiving others to a level that Allah loves. It is a powerful reminder that in moments of anger, your patience and compassion are the greatest tests of your faith."
    }, {
        "ayah": "42:36-37",
        "ayahNumber": 4555,
        "topic": "Forgiveness in moments of anger.",
        "arabic": "فَمَآ أُوتِيتُم مِّن شَىْءٍۢ فَمَتَـٰعُ ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَمَا عِندَ ٱللَّهِ خَيْرٌۭ وَأَبْقَىٰ لِلَّذِينَ ءَامَنُوا۟ وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ ٥ وَٱلَّذِينَ يَجْتَنِبُونَ كَبَـٰٓئِرَ ٱلْإِثْمِ وَٱلْفَوَٰحِشَ وَإِذَا مَا غَضِبُوا۟ هُمْ يَغْفِرُونَ ٥",
        "translation": "Whatever [pleasure] you have been given is [no more than a fleeting] enjoyment of this worldly life. But what is with Allah is far better and more lasting for those who believe and put their trust in their Lord; who avoid major sins and shameful deeds, and forgive when angered.",
        "commentarySource": "Links forgiveness as a key characteristic of the righteous (Tafsir Ibn Kathir).",
        "noteToUser": "This verse directly addresses the reality of feeling angry. It teaches us that the sign of a strong believer is not the absence of anger, but the ability to forgive when it is felt. Forgiveness is a conscious and powerful choice, and it's what defines a believer's character."
    }, {
        "ayah": "41:34",
        "ayahNumber": 4505,
        "topic": "The best response to evil.",
        "arabic": "وَلَا تَسْتَوِى ٱلْحَسَنَةُ وَلَا ٱلسَّيِّئَةُ ۚ ٱدْفَعْ بِٱلَّتِى هِىَ أَحْسَنُ فَإِذَا ٱلَّذِى بَيْنَكَ وَبَيْنَهُۥ عَدَٰوَةٌۭ كَأَنَّهُۥ وَلِىٌّ حَمِيمٌۭ ٥",
        "translation": "Good and evil cannot be equal. Respond [to evil] with what is best, then the one you are in a feud with will be like a close friend.",
        "commentarySource": "A powerful lesson in dealing with hostility, cited by scholars like Nouman Ali Khan.",
        "noteToUser": "When someone has wronged you and you feel anger, this verse gives you a new perspective. It encourages you to not respond in kind, but to use a better deed (like forgiveness or a good word) to transform the situation. This can lead to a change in the other person's heart, and a healing of your own."
    }, {
        "ayah": "3:159",
        "ayahNumber": 466,
        "topic": "Humility and forgiveness.",
        "arabic": "فَبِمَا رَحْمَةٍۢ مِّنَ ٱللَّهِ لِنتَ لَهُمْ ۖ وَلَوْ كُنتَ فَظًّا غَلِيظَ ٱلْقَلْبِ لَٱنفَضُّوا۟ مِنْ حَوْلِكَ ۖ فَٱعْفُ عَنْهُمْ وَٱسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِى ٱلْأَمْرِ ۖ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى ٱللَّهِ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُتَوَكِّلِينَ ٥",
        "translation": "It is out of Allah's mercy that you [O Prophet] have been lenient with them. Had you been cruel or hard-hearted, they would have certainly abandoned you. So pardon them, ask Allah's forgiveness for them, and consult with them in [conducting] matters. Once you make a decision, put your trust in Allah. Surely Allah loves those who trust in Him.",
        "commentarySource": "A direct address to the Prophet (PBUH) from Allah.",
        "noteToUser": "This verse is a powerful reminder of how Allah wants us to behave. Even the Prophet Muhammad (PBUH) was told to be lenient and to pardon others. Your forgiveness and gentle heart are signs of immense strength, and they are what attract others to you and, ultimately, to Allah's mercy."
    }, {
        "ayah": "7:199",
        "ayahNumber": 1138,
        "topic": "Holding to forgiveness.",
        "arabic": "خُذِ ٱلْعَفْوَ وَأْمُرْ بِٱلْعُرْفِ وَأَعْرِضْ عَنِ ٱلْجَـٰهِلِينَ ٥",
        "translation": "Be gracious, enjoin what is right, and turn away from those who act ignorantly.",
        "commentarySource": "A summary of the best approach to handling negative interactions.",
        "noteToUser": "This verse provides a three-part solution to dealing with situations that provoke anger. It tells you to be forgiving, to continue to do what is right, and to simply turn away from those who are ignorant. It is a beautiful lesson in preserving your peace and dignity by not engaging in unproductive arguments."
    }],
    "fear": [{
        "ayah": "3:173",
        "ayahNumber": 480,
        "topic": "Allah is sufficient for us.",
        "arabic": "ٱلَّذِينَ قَالَ لَهُمُ ٱلنَّاسُ إِنَّ ٱلنَّاسَ قَدْ جَمَعُوا۟ لَكُمْ فَٱخْشَوْهُمْ فَزَادَهُمْ إِيمَـٰنًۭا وَقَالُوا۟ حَسْبُنَا ٱللَّهُ وَنِعْمَ ٱلْوَكِيلُ ٥",
        "translation": "Those who were warned, 'Your enemies have mobilized their forces against you, so fear them,' the warning only made them grow stronger in faith and they replied, 'Allah [alone] is sufficient [as an aid] for us and [He] is the best Protector.'",
        "commentarySource": "The source of the famous supplication 'Hasbunallah wa ni'mal wakeel'.",
        "noteToUser": "This is the ultimate statement to say when you feel fear or are in a situation that feels overwhelming. By declaring that Allah is sufficient, you are transferring all your worries and fears to Him. He is the best Disposer of affairs, and by relying on Him, you can find inner courage and peace."
    }, {
        "ayah": "2:62",
        "ayahNumber": 69,
        "topic": "The reward for faith.",
        "arabic": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلنَّصَـٰرَىٰ وَٱلصَّـٰبِـِٔينَ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَعَمِلَ صَـٰلِحًۭا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ ٥",
        "translation": "Indeed, the believers, Jews, Christians, and Sabians — whoever [truly] believes in Allah and the Last Day and does good will have their reward with their Lord. And there will be no fear for them, nor will they grieve.",
        "commentarySource": "A promise of a state of no fear and no grief for believers in the Quran.",
        "noteToUser": "This is a promise of what true faith gives you. When you have sincere belief in Allah and do good, you are promised a state of being free from both fear for the future and grief for the past. It is a powerful reminder that faith is the ultimate antidote to both anxiety and sadness."
    }, {
        "ayah": "8:30",
        "ayahNumber": 1173,
        "topic": "Allah is the best of planners.",
        "arabic": "وَإِذْ يَمْكُرُ بِكَ ٱلَّذِينَ كَفَرُوا۟ لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ ۚ وَيَمْكُرُونَ وَيَمْكُرُ ٱللَّهُ ۖ وَٱللَّهُ خَيْرُ ٱلْمَـٰكِرِينَ ٥",
        "translation": "And [remember, O  Prophet,] when the disbelievers conspired to capture, kill, or exile you. They planned, but Allah also planned. And Allah is the best of planners.",
        "commentarySource": "Revealed to the Prophet (PBUH) when the disbelievers were plotting against him.",
        "noteToUser": "When the world seems to be conspiring against you and you feel fear about what will happen, this verse provides a new perspective. It reminds you that all human plans are insignificant compared to Allah's divine and perfect plan. By entrusting your fate to Him, you can find relief from all your fears."
    }, {
        "ayah": "40:44",
        "ayahNumber": 4434,
        "topic": "Entrusting your affairs to Allah.",
        "arabic": "فَسَتَذْكُرُونَ مَآ أَقُولُ لَكُمْ ۚ وَأُفَوِّضُ أَمْرِىٓ إِلَى ٱللَّهِ ۚ إِنَّ ٱللَّهَ بَصِيرٌۢ بِٱلْعِبَادِ ٥",
        "translation": "You will remember what I say to you, and I entrust my affairs to Allah. Surely Allah is All-Seeing of all [His] servants.",
        "commentarySource": "A famous supplication of a believer mentioned in the Quran.",
        "noteToUser": "This verse is a perfect supplication to recite when you feel overwhelmed. By saying 'I entrust my affair to Allah,' you are verbally and spiritually handing over your worries and fears. It is a beautiful act of worship that reminds you that Allah is fully aware of your situation and will take care of you."
    }, {
        "ayah": "65:3",
        "ayahNumber": 5262,
        "topic": "Providing from where you least expect.",
        "arabic": "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ فَهُوَ حَسْبُهُۥٓ ۚ إِنَّ ٱللَّهَ بَـٰلِغُ أَمْرِهِۦ ۚ قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَىْءٍۢ قَدْرًۭا ٥",
        "translation": "And provide for them from sources they could never imagine. And whoever puts their trust in Allah, then He [alone] is sufficient for them. Certainly Allah achieves His Will. Allah has already set a destiny for everything.",
        "commentarySource": "A well-known promise for those who rely on Allah.",
        "noteToUser": "Your fear may be about provision or what the future holds. This verse promises that if you put your full trust in Allah, He will provide for you from sources you never imagined. This assurance is a powerful antidote to a fear of the unknown."
    }],
    "surprise": [{
        "ayah": "11:73",
        "ayahNumber": 1572,
        "topic": "Surprise at Allah's decree.",
        "arabic": "قَالُوٓا۟ أَتَعْجَبِينَ مِنْ أَمْرِ ٱللَّهِ ۖ رَحْمَتُ ٱللَّهِ وَبَرَكَـٰتُهُۥ عَلَيْكُمْ أَهْلَ ٱلْبَيْتِ ۚ إِنَّهُۥ حَمِيدٌۭ مَّجِيدٌۭ ٥",
        "translation": "They responded, 'Are you astonished by Allah's decree? May Allah's mercy and blessings be upon you, O  people of this house. Indeed, He is Praiseworthy, All-Glorious.'",
        "commentarySource": "A direct response from the angels to Prophet Abraham's wife Sarah, who was surprised at the news of her pregnancy.",
        "noteToUser": "This verse reminds us that we should not be surprised by the power of Allah. When an unexpected blessing or a miraculous event happens, this verse teaches us that it is all part of Allah's decree. He is glorious and can do all things, and His blessings are always a cause for praise."
    }, {
        "ayah": "28:76",
        "ayahNumber": 3394,
        "topic": "Surprise at immense wealth.",
        "arabic": "إِنَّ قَـٰرُونَ كَانَ مِن قَوْمِ مُوسَىٰ فَبَغَىٰ عَلَيْهِمْ ۖ وَءَاتَيْنَـٰهُ مِنَ ٱلْكُنُوزِ مَآ إِنَّ مَفَاتِحَهُۥ لَتَنُوٓأُ بِٱلْعُصْبَةِ أُو۟لِى ٱلْقُوَّةِ إِذْ قَالَ لَهُۥ قَوْمُهُۥ لَا تَفْرَحْ ۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْفَرِحِينَ ٥",
        "translation": "Indeed, Korah was from the people of Moses, but he behaved arrogantly towards them. We had granted him such treasures that even their keys would burden a group of strong men. [Some of] his people advised him, 'Do not be prideful! Surely Allah does not like the prideful.",
        "commentarySource": "Part of the story of Korah, often cited to show that a believer's focus should not be on material possessions.",
        "noteToUser": "When a sudden and surprising amount of wealth or worldly success comes to you or to others, this verse provides a warning. It reminds you that such blessings, when they are a cause of arrogance and not gratitude, can be a great test. True surprise should be in the awe of Allah's power, not in worldly things."
    }, {
        "ayah": "21:103",
        "ayahNumber": 2631,
        "topic": "A beautiful ending.",
        "arabic": "لَا يَحْزُنُهُمُ ٱلْفَزَعُ ٱلْأَكْبَرُ وَتَتَلَقَّىٰهُمُ ٱلْمَلَـٰٓئِكَةُ هَـٰذَا يَوْمُكُمُ ٱلَّذِى كُنتُمْ تُوعَدُونَ ٥",
        "translation": "The Supreme Horror [of that Day] will not disturb them, and the angels will greet them, [saying,] 'This is your Day, which you have been promised.'",
        "noteToUser": "When you are surprised by the unexpected joys in your life, this verse is a great reminder that the most amazing and incredible surprise is what awaits a believer in the Hereafter. The true reward of this life's efforts is the joy of seeing the angels greet you on that day."
    }, {
        "ayah": "13:16",
        "ayahNumber": 1770,
        "topic": "The power of Allah to create.",
        "arabic": "قُلْ مَن رَّبُّ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ قُلِ ٱللَّهُ ۚ قُلْ أَفَٱتَّخَذْتُم مِّن دُونِهِۦٓ أَوْلِيَآءَ لَا يَمْلِكُونَ لِأَنفُسِهِمْ نَفْعًۭا وَلَا ضَرًّۭا ۚ قُلْ هَلْ يَسْتَوِى ٱلْأَعْمَىٰ وَٱلْبَصِيرُ أَمْ هَلْ تَسْتَوِى ٱلظُّلُمَـٰتُ وَٱلنُّورُ ۗ أَمْ جَعَلُوا۟ لِلَّهِ شُرَكَآءَ خَلَقُوا۟ كَخَلْقِهِۦ فَتَشَـٰبَهَ ٱلْخَلْقُ عَلَيْهِمْ ۚ قُلِ ٱللَّهُ خَـٰلِقُ كُلِّ شَىْءٍۢ وَهُوَ ٱلْوَٰحِدُ ٱلْقَهَّـٰرُ ٥",
        "translation": "Ask [them, O  Prophet], 'Who is the Lord of the heavens and the earth?' Say, 'Allah!' Ask [them], 'Why [then] have you taken besides Him lords who cannot even benefit or protect themselves?' Say, 'Can the blind and the sighted be equal? Or can darkness and light be equal?' Or have they associated with Allah partners who [supposedly] produced a creation like His, leaving them confused between the two creations? Say, 'Allah is the Creator of all things, and He is the One, the Supreme.'",
        "commentarySource": "Part of a series of verses that asks rhetorical questions about Allah's power.",
        "noteToUser": "When you are in awe of something in this world, this verse reminds you to be truly amazed by the Creator. It asks you to reflect on the immense power of Allah, who created everything from the heavens to the earth, and to not be surprised by the actions of anything other than Him."
    }, {
        "ayah": "27:10",
        "ayahNumber": 3209,
        "topic": "Awe and humbling yourself before Allah.",
        "arabic": "وَأَلْقِ عَصَاكَ ۚ فَلَمَّا رَءَاهَا تَهْتَزُّ كَأَنَّهَا جَآنٌّۭ وَلَّىٰ مُدْبِرًۭا وَلَمْ يُعَقِّبْ ۚ يَـٰمُوسَىٰ لَا تَخَفْ إِنِّى لَا يَخَافُ لَدَىَّ ٱلْمُرْسَلُونَ ٥",
        "translation": "Now, throw down your staff!' But when he saw it slithering like a snake, he ran away without looking back. [Allah reassured him,] 'O Moses! Do not be afraid! Messengers should have no fear in My presence.",
        "commentarySource": "Describes the initial moment of Moses' prophecy, where he was surprised and afraid of the miracle before him.",
        "noteToUser": "This verse reminds us that even the prophets were surprised and afraid by Allah's power. It teaches us that our surprise should lead to humility, not a loss of faith. When something unexpected happens, it's an opportunity to humble yourself before Allah and be assured that with Him, there is nothing to fear."
    }]
}